12/data/attachments/c7e58a0821db5926.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d687860b-2364-4b89-af16-4ccb3a34a4c6</nif:username>
            <nif:friendToBeAdded>Brent_how_Friend_89182_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>